isobusDev.org
#+title: Project Journal: 4th gen DisTEK ISOBUS Dev
#+setupfile: https://0xbadc0fee.github.io/org-html-themes/org/theme-readtheorg.setup
#+TODO: TODO(t) WAIT(w@/!) Q&A(q) | DONE(d!) CANCELED(c@)
#+options: ^:nil

* 2024
** 2024-04 April
*** 2024-04-29 Monday
**** Initial Onboarding
***** TODO Status Review [5/5]
- [X] Teams meeting notes
- [X] Current / Completed Jira Tasks
- [X] Pull current Repo
  - most current branch is reorg_github
  - branch main does not have git submodule info at this time
- [X] Capture current tree structure for doc
  #+begin_src shell
  Folder PATH listing for volume OS
Volume serial number is 36BC-0D71
C:.
+---bat
+---doc
+---ESXheaders
¦   +---GEN3
¦   ¦   +---esx.3cX
¦   ¦   +---esx.3cX_safety
¦   ¦   ¦   +---xs_api
¦   ¦   ¦   +---x_api
¦   ¦   +---esx.3xX
¦   ¦   +---esx.ioxp
¦   +---GEN4
¦       +---esx.4cl
¦       +---esx.4cm
¦       +---esx.4cs
¦       +---esx.4ct
+---pjt
+---result_libs
¦   +---doc
¦   +---include
¦   +---tools
+---tmp
¦   +---Virtec_3Cx
¦   ¦   +---VirtecSubModules
¦   ¦       +---Foundation
¦   ¦       +---Platform
¦   ¦       +---TCClient
¦   ¦       +---VTClient
¦   +---Virtec_3Cx_Safety
¦   ¦   +---VirtecSubModules
¦   ¦       +---Foundation
¦   ¦       +---Platform
¦   ¦       +---TCClient
¦   ¦       +---VTClient
¦   +---Virtec_3Xx
¦   ¦   +---VirtecSubModules
¦   ¦       +---Foundation
¦   ¦       +---Platform
¦   ¦       +---TCClient
¦   ¦       +---VTClient
¦   +---Virtec_4cl
¦   ¦   +---VirtecSubModules
¦   ¦       +---Foundation
¦   ¦       +---Platform
¦   ¦       +---TCClient
¦   ¦       +---VTClient
¦   +---Virtec_4cm
¦   ¦   +---VirtecSubModules
¦   ¦       +---Foundation
¦   ¦       +---Platform
¦   ¦       +---TCClient
¦   ¦       +---VTClient
¦   +---Virtec_4cs
¦   ¦   +---VirtecSubModules
¦   ¦       +---Foundation
¦   ¦       +---Platform
¦   ¦       +---TCClient
¦   ¦       +---VTClient
¦   +---Virtec_4ct
¦       +---VirtecSubModules
¦           +---Foundation
¦           +---Platform
¦           +---TCClient
¦           +---VTClient
+---VirtecSubModules
    +---Foundation
    +---Platform
    +---TCClient
    +---VTClient

  #+end_src
- [X] Open a knownGood in LogiCAD and confirms build w/o errors
  - [X] 4CL
  - [X] 4CM
  - [X] 4CS
  - [X] 4CT
  - [X] Typical Results
    #+begin_src shell
Block  Ver  Area   Block-Address  Start-Address End-Address   Signature-Type
============================================================================
00000  004  00000  0x80014200     0x80014000    0x80017FFF    CRC-32Swapped
00000  004  00001  0x80014200     0x80500000    0x8056DE2B    CRC-32Swapped
00000  004  00002  0x80014200     (empty area)  (empty area)  CRC-32Swapped
00000  004  00003  0x80014200     (empty area)  (empty area)  CRC-32Swapped
00000  004  00004  0x80014200     (empty area)  (empty area)  CRC-32Swapped
00000  004  00005  0x80014200     (empty area)  (empty area)  CRC-32Swapped

Validating signature blocks ...
Filling gaps ...
Calculating signatures ...
Patching data ...
Writing target hex file "C:\stw\isobus\esx-isobus-example_gen4\ESX_4CM_A/appl_core_release/appl_core.hex" ...
Target hex file written. Finished.

13:25:50 Build Finished. 0 errors, 8 warnings. (took 6s.443ms)
    #+end_src
***** Doc Outline "Getting Started"
****** Clone Repository
****** Open & Build Template Projects
****** Open & Build Example Projects
****** Modify and Run an Application
***** JOURNAL
****** Cloning
+ DO NOT need to pull esx-isobus repo.  Can get started by pulling one of the example repos
+ DO update submodules.  After git pull, need to run some variation of submodule update;
  + OPTION 1: git submodule update --init (init required for first submodule download)
  + OPTION 2 (best): get submodule update --init --recursive (w/o recursive has to be updated in folders that need submodules, recursive search whole tree)
+ DO LogiCAD-> Open Projects from file System -> select folder esx-isobus-example_gen4
+ DO test build any / all of the gen4 examples to confirm no build problems, all files accounted for
****** Template Projects (gen4 bundle)
+ NOTE each 4th gen device template, e.g. ~isobus-esx_G4_esx.4cl~ links to the common ISOBUS dependencies in the separate LogiCAD project ~isobus-esxG4~
+ WARNING some known problems when working with submodule repos.  If user is trying to sync first time submodule update via SSH and is presented with need for username and password,
  there may be some problems.  Only noticed when pulling repo into a linux VM being used for note / journal capture.  Most use cases would be pulling repo into
  Win based dev env.  In windows env, just make sure using a git client like GitBash.  No problems syncing submodules this way. Tested mult times, consistent behavior.  Only pull via windows.
*** 2024-04-30 Tuesday
****  ESX template testing continued
