isobusDev.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-10 Fri 06:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Project Journal: 4th gen DisTEK ISOBUS Dev</title>
<meta name="author" content="scurfman" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://0xbadc0fee.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://0xbadc0fee.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Project Journal: 4th gen DisTEK ISOBUS Dev</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga6d9af4">1. 2024</a>
<ul>
<li><a href="#orgebd6bd7">1.1. 2024-04 April</a>
<ul>
<li><a href="#org786b556">1.1.1. 2024-04-29 Monday</a></li>
<li><a href="#org7041350">1.1.2. 2024-04-30 Tuesday</a></li>
</ul>
</li>
<li><a href="#org35e03b6">1.2. 2024-05 May</a>
<ul>
<li><a href="#orgeeb2b6d">1.2.1. 2024-05-07 Tuesday</a></li>
<li><a href="#orga13a88b">1.2.2. 2024-05-08 Wednesday</a></li>
<li><a href="#orgfeab649">1.2.3. 2024-05-10 Friday</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga6d9af4" class="outline-2">
<h2 id="orga6d9af4"><span class="section-number-2">1.</span> 2024</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgebd6bd7" class="outline-3">
<h3 id="orgebd6bd7"><span class="section-number-3">1.1.</span> 2024-04 April</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org786b556" class="outline-4">
<h4 id="org786b556"><span class="section-number-4">1.1.1.</span> 2024-04-29 Monday</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="orgdb967de"></a>Initial Onboarding<br />
<ol class="org-ol">
<li><a id="orga6dbc5a"></a><span class="todo TODO">TODO</span> Status Review <code>[5/5]</code><br />
<div class="outline-text-6" id="text-1-1-1-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Teams meeting notes</li>
<li class="on"><code>[X]</code> Current / Completed Jira Tasks</li>
<li class="on"><code>[X]</code> Pull current Repo
<ul class="org-ul">
<li>most current branch is reorg_github</li>
<li>branch main does not have git submodule info at this time</li>
</ul></li>
<li class="on"><code>[X]</code> <p>
Capture current tree structure for doc
</p>
<div class="org-src-container">
<pre class="src src-shell">  Folder PATH listing for volume OS
Volume serial number is <span style="color: #a45bad;">36BC-0D71</span>
C:.
+---bat
+---doc
+---ESXheaders
&#166;   +---GEN3
&#166;   &#166;   +---esx.3cX
&#166;   &#166;   +---esx.3cX_safety
&#166;   &#166;   &#166;   +---xs_api
&#166;   &#166;   &#166;   +---x_api
&#166;   &#166;   +---esx.3xX
&#166;   &#166;   +---esx.ioxp
&#166;   +---GEN4
&#166;       +---esx.4cl
&#166;       +---esx.4cm
&#166;       +---esx.4cs
&#166;       +---esx.4ct
+---pjt
+---result_libs
&#166;   +---doc
&#166;   +---include
&#166;   +---tools
+---tmp
&#166;   +---Virtec_3Cx
&#166;   &#166;   +---VirtecSubModules
&#166;   &#166;       +---Foundation
&#166;   &#166;       +---Platform
&#166;   &#166;       +---TCClient
&#166;   &#166;       +---VTClient
&#166;   +---Virtec_3Cx_Safety
&#166;   &#166;   +---VirtecSubModules
&#166;   &#166;       +---Foundation
&#166;   &#166;       +---Platform
&#166;   &#166;       +---TCClient
&#166;   &#166;       +---VTClient
&#166;   +---Virtec_3Xx
&#166;   &#166;   +---VirtecSubModules
&#166;   &#166;       +---Foundation
&#166;   &#166;       +---Platform
&#166;   &#166;       +---TCClient
&#166;   &#166;       +---VTClient
&#166;   +---Virtec_4cl
&#166;   &#166;   +---VirtecSubModules
&#166;   &#166;       +---Foundation
&#166;   &#166;       +---Platform
&#166;   &#166;       +---TCClient
&#166;   &#166;       +---VTClient
&#166;   +---Virtec_4cm
&#166;   &#166;   +---VirtecSubModules
&#166;   &#166;       +---Foundation
&#166;   &#166;       +---Platform
&#166;   &#166;       +---TCClient
&#166;   &#166;       +---VTClient
&#166;   +---Virtec_4cs
&#166;   &#166;   +---VirtecSubModules
&#166;   &#166;       +---Foundation
&#166;   &#166;       +---Platform
&#166;   &#166;       +---TCClient
&#166;   &#166;       +---VTClient
&#166;   +---Virtec_4ct
&#166;       +---VirtecSubModules
&#166;           +---Foundation
&#166;           +---Platform
&#166;           +---TCClient
&#166;           +---VTClient
+---VirtecSubModules
    +---Foundation
    +---Platform
    +---TCClient
    +---VTClient

</pre>
</div></li>
<li class="on"><code>[X]</code> Open a knownGood in LogiCAD and confirms build w/o errors
<ul class="org-ul">
<li class="on"><code>[X]</code> 4CL</li>
<li class="on"><code>[X]</code> 4CM</li>
<li class="on"><code>[X]</code> 4CS</li>
<li class="on"><code>[X]</code> 4CT</li>
<li class="on"><code>[X]</code> <p>
Typical Results
</p>
<div class="org-src-container">
<pre class="src src-shell">Block  Ver  Area   Block-Address  Start-Address End-Address   Signature-Type
============================================================================
<span style="color: #a45bad;">00000</span>  <span style="color: #a45bad;">004</span>  <span style="color: #a45bad;">00000</span>  <span style="color: #a45bad;">0x80014200</span>     <span style="color: #a45bad;">0x80014000</span>    <span style="color: #a45bad;">0x80017FFF</span>    CRC-32Swapped
<span style="color: #a45bad;">00000</span>  <span style="color: #a45bad;">004</span>  <span style="color: #a45bad;">00001</span>  <span style="color: #a45bad;">0x80014200</span>     <span style="color: #a45bad;">0x80500000</span>    <span style="color: #a45bad;">0x8056DE2B</span>    CRC-32Swapped
<span style="color: #a45bad;">00000</span>  <span style="color: #a45bad;">004</span>  <span style="color: #a45bad;">00002</span>  <span style="color: #a45bad;">0x80014200</span>     <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  CRC-32Swapped
<span style="color: #a45bad;">00000</span>  <span style="color: #a45bad;">004</span>  <span style="color: #a45bad;">00003</span>  <span style="color: #a45bad;">0x80014200</span>     <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  CRC-32Swapped
<span style="color: #a45bad;">00000</span>  <span style="color: #a45bad;">004</span>  <span style="color: #a45bad;">00004</span>  <span style="color: #a45bad;">0x80014200</span>     <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  CRC-32Swapped
<span style="color: #a45bad;">00000</span>  <span style="color: #a45bad;">004</span>  <span style="color: #a45bad;">00005</span>  <span style="color: #a45bad;">0x80014200</span>     <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  CRC-32Swapped

Validating signature blocks ...
Filling gaps ...
Calculating signatures ...
Patching data ...
Writing target hex file <span style="color: #2d9574;">"C:\stw\isobus\esx-isobus-example_gen4\ESX_4CM_A/appl_core_release/appl_core.hex"</span> ...
Target hex file written. Finished.

<span style="color: #a45bad;">13:25:50</span> Build Finished. <span style="color: #a45bad;">0</span> errors, <span style="color: #a45bad;">8</span> warnings. <span style="color: #4f97d7;">(</span>took <span style="color: #a45bad;">6s.443ms</span><span style="color: #4f97d7;">)</span>
</pre>
</div></li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org928e622"></a>Doc Outline "Getting Started"<br />
<ol class="org-ol">
<li><a id="org78a0a2f"></a>Clone Repository<br /></li>
<li><a id="orgb19f6bf"></a>Open &amp; Build Template Projects<br /></li>
<li><a id="orgd1afaa8"></a>Open &amp; Build Example Projects<br /></li>
<li><a id="org8fac653"></a>Modify and Run an Application<br /></li>
</ol>
</li>
<li><a id="org96d1a7c"></a>JOURNAL<br />
<ol class="org-ol">
<li><a id="orgc0e192d"></a>Cloning<br />
<div class="outline-text-7" id="text-1-1-1-1-3-1">
<ul class="org-ul">
<li>DO NOT need to pull esx-isobus repo.  Can get started by pulling one of the example repos</li>
<li>DO update submodules.  After git pull, need to run some variation of submodule update;
<ul class="org-ul">
<li>OPTION 1: git submodule update &#x2013;init (init required for first submodule download)</li>
<li>OPTION 2 (best): get submodule update &#x2013;init &#x2013;recursive (w/o recursive has to be updated in folders that need submodules, recursive search whole tree)</li>
</ul></li>
<li>DO LogiCAD-&gt; Open Projects from file System -&gt; select folder esx-isobus-example_gen4</li>
<li>DO test build any / all of the gen4 examples to confirm no build problems, all files accounted for</li>
</ul>
</div>
</li>
<li><a id="org9da53b4"></a>Template Projects (gen4 bundle)<br />
<div class="outline-text-7" id="text-1-1-1-1-3-2">
<ul class="org-ul">
<li>NOTE each 4th gen device template, e.g. <code>isobus-esx_G4_esx.4cl</code> links to the common ISOBUS dependencies in the separate LogiCAD project <code>isobus-esxG4</code></li>
<li>WARNING some known problems when working with submodule repos.  If user is trying to sync first time submodule update via SSH and is presented with need for username and password,
there may be some problems.  Only noticed when pulling repo into a linux VM being used for note / journal capture.  Most use cases would be pulling repo into
Win based dev env.  In windows env, just make sure using a git client like GitBash.  No problems syncing submodules this way. Tested mult times, consistent behavior.  Only pull via windows.</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org7041350" class="outline-4">
<h4 id="org7041350"><span class="section-number-4">1.1.2.</span> 2024-04-30 Tuesday</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="orgadc6a74"></a>ESX template testing continued<br />
<ol class="org-ol">
