isobusDev.html
<li><a id="org383c6f8"></a><span class="todo TODO">TODO</span> Individual ESX Template Tests <code>[12/12]</code><br />
<div class="outline-text-6" id="text-1-1-2-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> <code>$ git clone git@github.com:STW-Technic-LP/esx-isobus-example_esx.4cm.git</code></li>
<li class="on"><code>[X]</code> <code>$ cd esx-isobus-example_esx.4cm</code></li>
<li class="on"><code>[X]</code> <code>$ git submodule update --init --recursive</code></li>
<li class="on"><code>[X]</code> Open LogiCAD3 in C perspective</li>
<li class="on"><code>[X]</code> File-&gt; Open Projects from File System</li>
<li class="on"><code>[X]</code> select folder "esx-isobus-example_esx.4cm"</li>
<li class="on"><code>[X]</code> Choose both projects</li>
<li class="on"><code>[X]</code> Ensure compiler license available</li>
<li class="on"><code>[X]</code> Select project with tag (in ESX_4CM_A)</li>
<li class="on"><code>[X]</code> Build Configurations&#x2026; -&gt; Build Selected&#x2026; -&gt; select (e.g. appl_core_release)</li>
<li class="on"><code>[X]</code> <p>
Results:
</p>
<div class="org-src-container">
<pre class="src src-shell">Block  Ver  Area   Block-Address  Start-Address End-Address   Signature-Type
============================================================================
<span style="color: #a45bad;">00000</span>  <span style="color: #a45bad;">004</span>  <span style="color: #a45bad;">00000</span>  <span style="color: #a45bad;">0x80014200</span>     <span style="color: #a45bad;">0x80014000</span>    <span style="color: #a45bad;">0x80017FFF</span>    CRC-32Swapped
<span style="color: #a45bad;">00000</span>  <span style="color: #a45bad;">004</span>  <span style="color: #a45bad;">00001</span>  <span style="color: #a45bad;">0x80014200</span>     <span style="color: #a45bad;">0x80500000</span>    <span style="color: #a45bad;">0x80568D57</span>    CRC-32Swapped
<span style="color: #a45bad;">00000</span>  <span style="color: #a45bad;">004</span>  <span style="color: #a45bad;">00002</span>  <span style="color: #a45bad;">0x80014200</span>     <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  CRC-32Swapped
<span style="color: #a45bad;">00000</span>  <span style="color: #a45bad;">004</span>  <span style="color: #a45bad;">00003</span>  <span style="color: #a45bad;">0x80014200</span>     <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  CRC-32Swapped
<span style="color: #a45bad;">00000</span>  <span style="color: #a45bad;">004</span>  <span style="color: #a45bad;">00004</span>  <span style="color: #a45bad;">0x80014200</span>     <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  CRC-32Swapped
<span style="color: #a45bad;">00000</span>  <span style="color: #a45bad;">004</span>  <span style="color: #a45bad;">00005</span>  <span style="color: #a45bad;">0x80014200</span>     <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  <span style="color: #4f97d7;">(</span>empty area<span style="color: #4f97d7;">)</span>  CRC-32Swapped

Validating signature blocks ...
Filling gaps ...
Calculating signatures ...
Patching data ...
Writing target hex file <span style="color: #2d9574;">"C:\stw\isobus_test_2\esx-isobus-example_esx.4cm\ESX_4CM_A/appl_core_release/appl_core.hex"</span> ...
Target hex file written. Finished.

<span style="color: #a45bad;">11:06:20</span> Build Finished. <span style="color: #a45bad;">0</span> errors, <span style="color: #a45bad;">8</span> warnings. <span style="color: #4f97d7;">(</span>took <span style="color: #a45bad;">6s.449ms</span><span style="color: #4f97d7;">)</span>
</pre>
</div></li>
<li class="on"><code>[X]</code> END, template valid</li>
</ul>
</div>
</li>
<li><a id="org82fa7ad"></a><span class="todo TODO">TODO</span> Test included openSYDE projects <code>[0/2]</code><br />
<div class="outline-text-6" id="text-1-1-2-1-2">
<ul class="org-ul">
<li class="trans"><code>[-]</code> Multi-Node Gen4 Kit <code>[4/6]</code>
<ul class="org-ul">
<li class="on"><code>[X]</code> Launch openSYDE (v1.51r0)</li>
<li class="on"><code>[X]</code> from repo directory, open <code>isobus-example_gen4.syde</code></li>
<li class="on"><code>[X]</code> find README's with TSP spec for each node in their project folders
"C:\&#x2026;\esx-isobus-example_gen4\ISOBUS\libs\ESXheaders\GEN4\esx.4cl"
"C:\&#x2026;\esx-isobus-example_gen4\ISOBUS\libs\ESXheaders\GEN4\esx.4cm"
"C:\&#x2026;\esx-isobus-example_gen4\ISOBUS\libs\ESXheaders\GEN4\esx.4cs"
"C:\&#x2026;\esx-isobus-example_gen4\ISOBUS\libs\ESXheaders\GEN4\esx.4ct"</li>
<li class="on"><code>[X]</code> Test project by running "Generate Files" (no datablocks assigned yet) on each node in project</li>
<li class="off"><code>[&#xa0;]</code> Q&amp;A Does user make separate copy of local folder for each dev project?
<ul class="org-ul">
<li>if so, user needs to make top level copy of whole project, not just a new Save As from within openSYDE (correct?)</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Q&amp;A pros / cons of starting with gen4 kit vs single-node kit?</li>
</ul></li>
<li class="trans"><code>[-]</code> Single-Node 4CM Example <code>[5/8]</code>
<ul class="org-ul">
<li class="on"><code>[X]</code> Launch openSYDE (v1.51r0)</li>
<li class="on"><code>[X]</code> from repo directory, open example project <code>isobus-ESX.4cm.syde</code></li>
<li class="on"><code>[X]</code> Confirm project has (1) Bus Diagnostic (1) Bus ISOBUS (1) Node ESX_4CM_A &amp; (1) Node ISOBUS_UT</li>
<li class="on"><code>[X]</code> Test project by running "Generate Files" (no datablocks assigned yet) on 4CM node</li>
<li class="on"><code>[X]</code> OPTIONAL: confirm still builds after last "Generate Files" via LogiCAD</li>
<li class="off"><code>[&#xa0;]</code> Q: <code>~../src/isobus/</code> includes subfolders for VT_Client_01 &amp; VT_Client_02; which client maps to which openSYDE node?
<ul class="org-ul">
<li>A:</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Q: user begins dev of ISOBUS app in VT_Client_0x.c ?
<ul class="org-ul">
<li>A:</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Q: in dev process, should only need openSYDE for flashing recompiled logiCAD results to device, not really using "Generate Files" between iterations?
<ul class="org-ul">
<li>A:</li>
</ul></li>
</ul></li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org35e03b6" class="outline-3">
<h3 id="org35e03b6"><span class="section-number-3">1.2.</span> 2024-05 May</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgeeb2b6d" class="outline-4">
<h4 id="orgeeb2b6d"><span class="section-number-4">1.2.1.</span> 2024-05-07 Tuesday</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
<li><a id="org1529a35"></a>Create Content for Onboarding DOC<br />
<ol class="org-ol">
<li><a id="org1565b9b"></a><span class="todo TODO">TODO</span> Conversion Content <code>[7/7]</code><br />
<div class="outline-text-6" id="text-1-2-1-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Locate 1 example each for CodeSYS 2.3 &amp; 3.5.  Should be very publicly available (codesys forge?)
<ul class="org-ul">
<li>use stable projects owned by STW.  Look at stwtechnic.freshdesk.com/support/solutions</li>
</ul></li>
<li class="on"><code>[X]</code> Manual Method: Duplicate conversion steps laid out in TSP IEC documentation, record output of each step
<ul class="org-ul">
<li>Steps laid out in section 10.5 of TSP docs</li>
<li>Use this tool lc3_codesys_converter.zip</li>
<li>Follow steps in How_to_import_code_from_codesys.txt</li>
<li class="on"><code>[X]</code> completed for 2.3 (CAN Examples)
<ul class="org-ul">
<li class="on"><code>[X]</code> Export Objects</li>
<li class="on"><code>[X]</code> Migrate POU's and data types</li>
<li class="on"><code>[X]</code> Migrate Global Variable List</li>
<li class="on"><code>[X]</code> Configure Tasks</li>
<li class="on"><code>[X]</code> Open in LogiCAD and test compile for errors.</li>
</ul></li>
</ul></li>
<li class="on"><code>[X]</code> Tool Method: use STW converter tool
<ul class="org-ul">
<li class="on"><code>[X]</code> Export entire sample CODESYS project into one file, do not rename.</li>
<li class="on"><code>[X]</code> Open example project in logiCAD based on this TSP</li>
<li class="on"><code>[X]</code> Confirm bare project compiles, has all libraries in correct places</li>
<li class="on"><code>[X]</code> Use Import method -&gt; Other -&gt; CodeSYS v2.3; choose .EXP file from above</li>
<li class="on"><code>[X]</code> Follow dialog, finish import</li>
<li class="on"><code>[X]</code> Recompile after import and check for errors.</li>
</ul></li>
<li class="on"><code>[X]</code> If completed w/o errors, outline a brief summary for onboardind doc</li>
<li class="on"><code>[X]</code> Edit onboarding doc</li>
<li class="on"><code>[X]</code> Send copy to KB for checking</li>
<li class="on"><code>[X]</code> Save to google drive and update Jira</li>
<li>misc:
<ul class="org-ul">
<li>tree struct before EXP export =
.</li>
</ul></li>
</ul>
<p>
└── ESXCAN
    ├── DEFAULT.DFR
    ├── ESX_CAN_FB.SDB
    ├── ESX_CAN_FB.SYM
    ├── ESX_CAN_FB.pro
    ├── ESX_CAN_FB00005528r.ci
    └── ESX_CAN_FB00005528r.ri
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orga13a88b" class="outline-4">
<h4 id="orga13a88b"><span class="section-number-4">1.2.2.</span> 2024-05-08 Wednesday</h4>
<div class="outline-text-4" id="text-1-2-2">
</div>
<ol class="org-ol">
<li><a id="org6e533d0"></a>Part 2 / Conversion Content<br />
<ol class="org-ol">
