isobusDev.org
***** TODO More notes for conversion testing (round 2)[10/10]
- [X] Get matching TSP
- [X] Install logiCAD v2.33
- [X] Check for / Install CodeSYS conversion tool
  - already installed in v2.33
- [X] Run TSP install utility (esx_4cm_a_logicad3_tsp.exe)
- [X] Follow TSP readme to open example project in logiCAD
  - First attempt hung process, 0900hr , wait 10 min, no good, killed process.
  - Second attempt, hung process, 0914hr , waitint
  - If no good, reboot, try to "update" project via openSYDE, launch logiCAD via openSYDE and see if it still hangs.
- [X] Confirm unchanged example project compiles in logiCAD
- [X] Prep a codesys project for import
  - [X] (1) .EXP for POU's / Data Types
  - [X] (1) .EXP for GLOBAL VARIABLES
- [X] Import sample codesys conversion into example project
- [X] Recompile
- [X] Report results / add content to onboarding doc.
*** 2024-05-10 Friday
**** ISOBUS review continued
***** TODO Misc [0/6]
- [ ] Finish reading printed material
- [ ] review any opensource / github projects
- [ ] review internal STW documentation
- [ ] review KB's Jira project on ISOBUS
- [ ] confirm with JG shipping of display unit
- [ ] check with dad on any isobus digistar scale heads locally
