isobusDev.html
<li><a id="orgaa90ef1"></a><span class="todo TODO">TODO</span> More notes for conversion testing (round 2)<code>[10/10]</code><br />
<div class="outline-text-6" id="text-1-2-2-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Get matching TSP</li>
<li class="on"><code>[X]</code> Install logiCAD v2.33</li>
<li class="on"><code>[X]</code> Check for / Install CodeSYS conversion tool
<ul class="org-ul">
<li>already installed in v2.33</li>
</ul></li>
<li class="on"><code>[X]</code> Run TSP install utility (esx_4cm_a_logicad3_tsp.exe)</li>
<li class="on"><code>[X]</code> Follow TSP readme to open example project in logiCAD
<ul class="org-ul">
<li>First attempt hung process, 0900hr , wait 10 min, no good, killed process.</li>
<li>Second attempt, hung process, 0914hr , waitint</li>
<li>If no good, reboot, try to "update" project via openSYDE, launch logiCAD via openSYDE and see if it still hangs.</li>
</ul></li>
<li class="on"><code>[X]</code> Confirm unchanged example project compiles in logiCAD</li>
<li class="on"><code>[X]</code> Prep a codesys project for import
<ul class="org-ul">
<li class="on"><code>[X]</code> (1) .EXP for POU's / Data Types</li>
<li class="on"><code>[X]</code> (1) .EXP for GLOBAL VARIABLES</li>
</ul></li>
<li class="on"><code>[X]</code> Import sample codesys conversion into example project</li>
<li class="on"><code>[X]</code> Recompile</li>
<li class="on"><code>[X]</code> Report results / add content to onboarding doc.</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgfeab649" class="outline-4">
<h4 id="orgfeab649"><span class="section-number-4">1.2.3.</span> 2024-05-10 Friday</h4>
<div class="outline-text-4" id="text-1-2-3">
</div>
<ol class="org-ol">
<li><a id="orgdd41544"></a>ISOBUS review continued<br />
<ol class="org-ol">
<li><a id="org1f97763"></a><span class="todo TODO">TODO</span> Misc <code>[0/6]</code><br />
<div class="outline-text-6" id="text-1-2-3-1-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Finish reading printed material</li>
<li class="off"><code>[&#xa0;]</code> review any opensource / github projects</li>
<li class="off"><code>[&#xa0;]</code> review internal STW documentation</li>
<li class="off"><code>[&#xa0;]</code> review KB's Jira project on ISOBUS</li>
<li class="off"><code>[&#xa0;]</code> confirm with JG shipping of display unit</li>
<li class="off"><code>[&#xa0;]</code> check with dad on any isobus digistar scale heads locally</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: scurfman</p>
<p class="date">Created: 2024-05-10 Fri 06:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>